# Taps
tap 'caskroom/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'

tap 'getantibody/tap'
tap 'thoughtbot/formulae'
tap 'scaleway/scaleway'
tap 'eugenmayer/dockersync'
tap 'wata727/tflint'
tap 'wallix/awless'
tap 'vitorgalvao/tiny-scripts'
tap 'buo/cask-upgrade'
tap 'golangci/tap'
tap 'chef/chef'
tap 'nexeck/homebrew-tmuxinator'

# Packages

## Homebrew
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'mas'

## Shell
cask 'iterm2'
brew 'zsh'
brew 'zsh-completion'
brew 'getantibody/tap/antibody'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'nexeck/homebrew-tmuxinator/tmuxinator'

## Dotfiles Tools
brew 'thoughtbot/formulae/rcm'

## Tools
cask 'keepingyouawake' # Prevent Mac from Sleeping

## Languages
### Go
brew 'go'
brew 'dep'
brew 'golangci/tap/golangci-lint'

### Java
cask 'java'

### Kotlin
brew 'kotlin'

### LUA
brew 'lua'

### Rust
brew 'rust'

### Erlang
brew 'erlang'
brew 'elixir'

### Python
brew 'python'
brew 'python@2'
brew 'pipenv'

### Node
brew 'node'
brew 'npm'

## Browser
cask 'google-chrome'
cask 'firefox'
cask 'tor-browser'

## IDE
cask 'atom'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
brew 'neovim'
cask 'arduino'
cask 'mysqlworkbench'

## GNU Utils
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'
brew 'autoconf'
brew 'automake'

## Security
brew 'gnupg'
cask 'gpg-suite'
cask 'tunnelblick'
cask 'dashlane'
brew 'gopass'
brew 'openssh'
cask 'authy'
brew 'hopenpgp-tools'
brew 'paperkey'
brew 'pinentry'
brew 'pinentry-mac'

## Yubikey
brew 'yubikey-personalization'
brew 'ykman'
cask 'yubico-yubikey-manager'
cask 'yubico-yubikey-personalization-gui'

## Backup
brew 'rsync'
brew 'rclone'
brew 'restic'

## Screensaver
cask 'padbury-clock'

## Utils
brew 'htop'
brew 'watch'
brew 'curl'
brew 'graphviz'
brew 'fzf'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'wget'
brew 'pv'
brew 'hugo'
brew 'plantuml'
brew 'tldr'
brew 'ansifilter'
brew 'p7zip'
cask 'meld'
brew 'tree'
brew 'whois'
brew 'bash'
brew 'thefuck'
brew 'shellcheck'
brew 'gomplate'
cask 'postman'
brew 'adr-tools'
cask 'etcher'
cask 'macs-fan-control'
brew 'fortio'
brew 'hostess'
cask 'boostnote'
brew 'bcal'
brew 'testssl'
brew 'stormssh'
brew 'miller'
cask 'keka'
cask 'daisydisk'
brew 'asciinema'
cask 'osxfuse'
brew 'fping'
brew 'liboping'
cask 'drawio'

## Password Tools
brew 'john-jumbo'
brew 'hashcat'

## Network
brew 'vegeta'
brew 'wireguard-tools'
cask 'angry-ip-scanner'
brew 'speedtest-cli'

brew 'lftp'
cask 'filezilla'

## Git
brew 'git'
brew 'git-lfs'
brew 'tig'
brew 'gist'
brew 'bfg' # BFG Repo-Cleaner
brew 'pre-commit'
brew 'git-town'
brew 'git-sizer'
cask 'sourcetree'
cask 'github'
brew 'hub'

## Reading
cask 'kindle'

## Development
brew 'protobuf'

### Cloud
brew 'scaleway/scaleway/scw'
brew 'awscli'
cask 'aws-vault'
brew 'wallix/awless/awless'

### IOT
brew 'platformio'
brew 'picocom'
brew 'avrdude'

### Driver
cask 'silicon-labs-vcp-driver'
cask 'prolific-pl2303'

### Docker
cask 'docker'
brew 'docker-machine-driver-xhyve'

### Kubernetes
cask 'minikube'
brew 'kubectl'
brew 'kubernetes-helm'

### Docker Sync
brew 'unison'
brew 'eugenmayer/dockersync/unox'

### DevOps
brew 'terraform'
# brew 'terraform-docs'
# brew 'terragrunt'
brew 'packer'
cask inspec
brew 'wata727/tflint/tflint'
# brew 'chamber'

## Fonts
cask 'font-hack-nerd-font-mono'
cask 'font-sourcecodepro-nerd-font-mono'
cask 'font-go-mono-nerd-font-mono'

## Communication
cask 'whatsapp'
#cask 'keybase'

## Office
cask 'microsoft-office'
cask 'skype-for-business'
cask 'onedrive'
cask 'microsoft-teams'
cask 'adobe-acrobat-reader'
#cask 'mactex'
cask 'zoomus'

## Multimedia
cask 'handbrake'
cask 'vlc'
cask 'amazon-music'
cask 'xld'
cask 'musicbrainz-picard'

## 3D Printing
cask 'blender'
cask 'ultimaker-cura'

# mas
mas 'Xcode', id: 497799835
