# Taps
tap 'caskroom/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/php'
tap 'homebrew/cask'

tap 'getantibody/tap'
tap 'thoughtbot/formulae'
tap 'scaleway/scaleway'
tap 'sam701/awstools'
tap 'eugenmayer/dockersync'
tap 'wata727/tflint'
tap 'wallix/awless'
tap 'timothyye/tap'
tap 'vitorgalvao/tiny-scripts'
tap 'buo/cask-upgrade'

# Packages

## Homebrew
brew 'vitorgalvao/tiny-scripts/cask-repair'

## Shell
cask 'iterm2'
cask 'upterm'
cask 'hyper'
brew 'zsh'
brew 'zsh-completion'
brew 'getantibody/tap/antibody'
brew 'tmux-xpanes'
brew 'tmux'
brew 'reattach-to-user-namespace'

## Tools
brew 'thoughtbot/formulae/rcm'
cask 'cheatsheet'
cask 'keepingyouawake'

### GNU Utils
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

### Security
brew 'gnupg'
cask 'gpgtools'
cask 'tunnelblick'
cask 'dashlane'
brew 'gopass'
brew 'openssh'
cask 'authy'
brew 'timothyye/tap/skm'

### Backup
brew 'rsync'
brew 'rclone'
brew 'restic'
#cask 'backblaze'

### Filesystem
brew 'unison'

### Screensaver
cask 'developerexcuses'
cask 'Fliqlo'
cask 'padbury-clock'

### Utils
brew 'htop'
brew 'watch'
brew 'graphviz'
brew 'fzf'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'wget'
brew 'pv'
brew 'hugo'
brew 'plantuml'
brew 'tldr'
brew 'ansifilter'
brew 'p7zip'
cask 'meld'
brew 'tree'
brew 'whois'
brew 'bash'
brew 'thefuck'
brew 'shellcheck'
brew 'gomplate'
cask 'postman'
brew 'adr-tools'
cask 'etcher'
cask 'macs-fan-control'
brew 'fortio'
brew 'hostess'
cask 'boostnote'
brew 'bcal'

### Network
brew 'vegeta'
brew 'wireguard-tools'
cask 'angry-ip-scanner'
brew 'speedtest-cli'

brew 'lftp'
cask 'filezilla'

### Git
brew 'git'
brew 'git-quick-stats'
brew 'git-cal'
brew 'git-extras'
brew 'git-town'
brew 'git-lfs'
brew 'tig'
brew 'hub'
brew 'gist'
brew 'bfg'
cask 'sourcetree'
cask 'github'
cask 'gitkraken'
brew 'git-sizer'
brew 'legit'

### Fun
brew 'fortune'
brew 'ponysay'

## Reading
cask 'kindle'

## Browser
cask 'google-chrome'
cask 'firefox'
cask 'tor-browser'

## Development
brew 'protobuf'

### Go
brew 'go'
brew 'dep'

### R
cask 'r-app'
cask 'rstudio'

### Java
cask 'java'

### Kotlin
brew 'kotlin'

### PHP
brew 'composer'

### LUA
brew 'lua'

### Cloud
brew 'sam701/awstools/awstools'
brew 'scaleway/scaleway/scw'
brew 'azure-cli'
brew 'awscli'
cask 'aws-vault'
brew 'duck'
brew 'wallix/awless/awless'

### IDE
cask 'atom'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
brew 'neovim'
brew 'micro'
cask 'arduino'
cask 'mysqlworkbench'

### IOT
brew 'platformio'
brew 'picocom'
brew 'avrdude'

### Driver
cask 'homebrew/cask-drivers/silicon-labs-vcp-driver'
cask 'homebrew/cask-drivers/prolific-pl2303'

### Kubernetes
cask 'minikube'
brew 'kubectl'
brew 'kubernetes-helm'

### Docker
cask 'docker'
brew 'docker-machine-driver-xhyve'

### Docker Sync
brew 'eugenmayer/dockersync/unox'

### DevOps
brew 'terraform'
brew 'terraform-docs'
#brew 'terragrunt'
brew 'packer'
#cask 'inspec'
brew 'wata727/tflint/tflint'
brew 'chamber'

## Fonts
cask 'homebrew/cask-fonts/font-hack-nerd-font-mono'
cask 'homebrew/cask-fonts/font-sourcecodepro-nerd-font-mono'
cask 'homebrew/cask-fonts/font-go-mono-nerd-font-mono'

## Communication
cask 'whatsapp'
cask 'slack'
cask 'riot'
cask 'keybase'

## Office
cask 'microsoft-office'
cask 'skype-for-business'
cask 'onedrive'
cask 'microsoft-teams'
cask 'adobe-acrobat-reader'
#cask 'mactex'
cask 'zoomus'
cask 'drawio'

## Multimedia
cask 'handbrake'
cask 'vlc'
cask 'amazon-music'
#cask 'darktable'
cask 'twitch'

## 3D Printing
cask 'blender'
cask 'ultimaker-cura'
