# Taps
tap 'caskroom/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'

tap 'getantibody/tap'
tap 'thoughtbot/formulae'
tap 'scaleway/scaleway'
tap 'eugenmayer/dockersync'
tap 'vitorgalvao/tiny-scripts'
tap 'buo/cask-upgrade'
tap 'golangci/tap'
tap 'chef/chef'
tap 'cjbassi/gotop'
tap 'wagoodman/dive'
tap 'aws/tap'
tap 'hivemq/mqtt-cli'

# Packages

## Homebrew
brew 'vitorgalvao/tiny-scripts/cask-repair'
brew 'mas'

## Shell
cask 'iterm2'
cask 'hyper'
brew 'zsh'
brew 'zsh-completion'
brew 'getantibody/tap/antibody'
brew 'tmux'
brew 'tmuxinator'
brew 'reattach-to-user-namespace'

## Dotfiles Tools
brew 'thoughtbot/formulae/rcm'

## Tools
cask 'keepingyouawake' # Prevent Mac from Sleeping

## Languages
### Go
brew 'go'
brew 'golangci/tap/golangci-lint'

### Rust
brew 'rustup'

### Java
cask 'java'

### Kotlin
# brew 'kotlin'

### LUA
brew 'lua'

### Python
brew 'python'
brew 'python@2'
brew 'pipenv'

### Node
brew 'node'

### Ruby
brew 'ruby'

## Browser
cask 'google-chrome'
cask 'firefox'
cask 'microsoft-edge'

## IDE
cask 'atom'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
brew 'neovim'

## GNU Utils
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'
brew 'autoconf'
brew 'automake'

## Security
brew 'gnupg'
cask 'gpg-suite'
cask 'tunnelblick'
brew 'gopass'
brew 'sops'
brew 'openssh'
brew 'sshuttle'
cask 'authy'
brew 'hopenpgp-tools'
brew 'paperkey'
brew 'pinentry'
brew 'pinentry-mac'
cask '1password-cli'

## Yubikey
brew 'yubikey-personalization'
brew 'ykman'
cask 'yubico-yubikey-manager'
cask 'yubico-yubikey-personalization-gui'

## Backup
brew 'rsync'
brew 'rclone'
brew 'restic'

## Utils
brew 'htop'
brew 'watch'
brew 'curl'
brew 'graphviz'
brew 'fzf'
brew 'exa'
brew 'jq'
brew 'yq'
brew 'wget'
brew 'pv'
brew 'hugo'
brew 'plantuml'
brew 'tldr'
brew 'ansifilter'
brew 'p7zip'
cask 'meld'
brew 'tree'
brew 'whois'
brew 'bash'
brew 'shellcheck'
brew 'gomplate'
cask 'postman'
brew 'adr-tools'
cask 'balenaetcher'
brew 'fortio'
brew 'hostess'
cask 'boostnote'
# cask 'notable'
brew 'bcal'
brew 'testssl'
brew 'stormssh'
brew 'miller'
cask 'keka'
cask 'daisydisk'
brew 'asciinema'
cask 'osxfuse'
brew 'fping'
brew 'liboping'
cask 'drawio'
brew 'cjbassi/gotop/gotop'
brew 'glances'
brew 'watchman'
brew 'doitlive'
brew 'mage'
brew 'gnu-time'
brew 'lz4'
brew 'iperf3'
brew 'telnet'
brew 'ack'
brew 'bat'
brew 'howdoi'
brew 'jrnl'
cask 'coconutbattery'
brew 'grip'
brew 'bandwhich'

## Fun
brew 'fortune'
brew 'ponysay'
brew 'cowsay'
brew 'lolcat'

## Documents
cask 'commander-one'
brew 'tesseract'
brew 'tesseract-lang'
brew 'ocrmypdf'
brew 'poppler'
brew 'exiftool'

## Password Tools
brew 'john-jumbo'
brew 'hashcat'

## Network
brew 'vegeta'
brew 'wireguard-tools'
cask 'angry-ip-scanner'
brew 'speedtest-cli'
brew 'nmap'

brew 'lftp'

## Git
brew 'git'
brew 'git-lfs'
brew 'git-tig'
brew 'gist'
brew 'bfg' # BFG Repo-Cleaner
brew 'pre-commit'
brew 'git-sizer'
cask 'sourcetree'
brew 'hub'

## Reading
# cask 'kindle'

## Development
brew 'protobuf'
brew 'asdf'

### Cloud
brew 'awscli'
cask 'aws-vault'

### IOT
brew 'platformio'
brew 'picocom'
brew 'avrdude'

### Driver
cask 'silicon-labs-vcp-driver'
cask 'prolific-pl2303'
cask 'logitech-options'

### Docker
cask 'docker'
brew 'docker-machine-driver-xhyve'
brew 'wagoodman/dive/dive'

### Docker Sync
brew 'unison'
brew 'eugenmayer/dockersync/unox'

### DevOps
brew 'terraform'
brew 'packer'
brew 'ansible'
brew 'aws-cdk'

## Fonts
cask 'font-hack-nerd-font-mono'
cask 'font-sourcecodepro-nerd-font-mono'
cask 'font-go-mono-nerd-font-mono'
cask 'font-cascadia'

## Communication
#cask 'keybase'

## Office
cask 'microsoft-office'
cask 'skype-for-business'
cask 'onedrive'
cask 'microsoft-teams'
cask 'discord'
cask 'zoom'
cask 'adobe-acrobat-reader'
cask 'edrawmax'
cask 'remote-desktop-manager-free'
cask 'teamviewer'

## Multimedia
#cask 'handbrake'
cask 'vlc'
cask 'iina'
cask 'amazon-music'
#cask 'musicbrainz-picard'

## Gaming
cask 'steam'
cask 'epic-games'
cask 'sony-ps4-remote-play'

## 3D Printing
#cask 'blender'
#cask 'ultimaker-cura'

# mas
mas 'Xcode', id: 497799835
mas 'Planner 5d', id: 1310584536
mas 'WireGuard', id: 1451685025
mas '1Password', id: 1333542190
mas 'Dashlane', id: 552383089
mas 'Whatsapp', id: 1147396723
mas 'Telegram', id: 747648890
mas 'Kindle', id: 405399194
mas 'Apple Configuratot 2', id: 1037126344
mas 'Outbank', id: 1094255754
